* SQLite
  #+PROPERTY: header-args:sqlite :db week_2.sqlite :dir db/

  Create hello_worlds
  #+begin_src sqlite
  CREATE TABLE hello_worlds(
  hello VARCHAR(10),
  world VARCHAR(10),
  language VARCHAR(10));
  #+end_src

  #+RESULTS:

  Insert data
  #+begin_src sqlite
  INSERT INTO hello_worlds VALUES
  ('hello', 'world', 'English'),
  ('ahoj', 'svet', 'Slovak'),
  ('holla', 'mundo', 'Spanish'),
  ("kon'nichiwa", 'sekai', 'Japanese'),
  ('olá', 'mundo', 'Portuguese'),
  ('hello', 'world', 'English'),
  ('ciao', null, 'Italian')
  ;
  #+end_src

  #+RESULTS:

  Check data
  #+begin_src sqlite
  SELECT * FROM hello_worlds;
  #+end_src

  #+RESULTS:
  | hello       | world | English    |
  | ahoj        | svet  | Slovak     |
  | holla       | mundo | Spanish    |
  | kon'nichiwa | sekai | Japanese   |
  | olá         | mundo | Portuguese |
  | hello       | world | English    |
  | ciao        |       | Italian    |

  Cleanup data
  #+begin_src sqlite :exports none
  DROP TABLE hello_worlds;
  #+end_src

  #+RESULTS:

  #+begin_src sqlite
  DELETE FROM hello_worlds;
  #+end_src

  #+RESULTS:

  install faker to generate some random data
  #+begin_src shell
  gem install faker
  #+end_src

  #+begin_src ruby :results output
  require 'faker'

  post_codes = ['LS25 3AX', 'W1 9SD', 'TF1 1JA', 'SE18 6EY', 'SE8 5PA', 'SE5 9JW']
  countries = (['GB'] * 5) + (['US'] * 3) + (['NZ'] * 2) + ['AU']

  first_names = %w(Oliver  George  Harry   Jack) +
                %w(Olivia   Emily   Amelia  Jessica  Lucy  Charlotte)
  20.times do
    first_name = first_names.sample
    row = [
      first_name,
      Faker::Name.last_name,
      Faker::PhoneNumber.phone_number,
      Faker::Internet.free_email(name: first_name),
      countries.sample,
      post_codes.sample,
    ].join("', '")

    puts "('#{row}'),"
  end

  #+end_src

  #+RESULTS:
  #+begin_example
  ('Charlotte', 'Crona', '(358) 543-3871 x11661', 'charlotte@gmail.com', 'US', 'LS25 3AX'),
  ('Oliver', 'Frami', '123-049-9312 x75410', 'oliver@hotmail.com', 'US', 'LS25 3AX'),
  ('George', 'Miller', '1-829-690-4711 x64244', 'george@gmail.com', 'US', 'LS25 3AX'),
  ('Emily', 'Nolan', '112-723-3906 x35944', 'emily@yahoo.com', 'NZ', 'LS25 3AX'),
  ('Oliver', 'Huel', '231-680-6707 x3907', 'oliver@yahoo.com', 'NZ', 'SE8 5PA'),
  ('Olivia', 'Bayer', '539.597.3784 x971', 'olivia@yahoo.com', 'GB', 'LS25 3AX'),
  ('Amelia', 'Ziemann', '439.776.0760 x16370', 'amelia@gmail.com', 'GB', 'TF1 1JA'),
  ('Harry', 'Weissnat', '287.861.7897 x723', 'harry@gmail.com', 'GB', 'SE18 6EY'),
  ('Emily', 'Stamm', '1-442-456-4126 x6543', 'emily@yahoo.com', 'AU', 'LS25 3AX'),
  ('Lucy', 'Lueilwitz', '(972) 434-9145', 'lucy@yahoo.com', 'US', 'SE18 6EY'),
  ('Amelia', 'Mertz', '(949) 299-5810 x72377', 'amelia@gmail.com', 'GB', 'SE8 5PA'),
  ('Lucy', 'Hintz', '728.939.5077', 'lucy@yahoo.com', 'NZ', 'LS25 3AX'),
  ('Oliver', 'Kuhic', '798-471-9536 x56285', 'oliver@gmail.com', 'US', 'TF1 1JA'),
  ('Jessica', 'Berge', '(923) 444-5956 x64054', 'jessica@yahoo.com', 'US', 'TF1 1JA'),
  ('George', 'Pouros', '1-546-234-2587 x3500', 'george@gmail.com', 'AU', 'W1 9SD'),
  ('Olivia', 'Kling', '592-680-6368 x47550', 'olivia@gmail.com', 'US', 'TF1 1JA'),
  ('Charlotte', 'Roob', '651-713-8277 x371', 'charlotte@hotmail.com', 'US', 'SE8 5PA'),
  ('Oliver', 'Cronin', '1-450-883-3600 x67866', 'oliver@gmail.com', 'GB', 'SE5 9JW'),
  ('Olivia', 'Morissette', '818-814-6348 x669', 'olivia@yahoo.com', 'GB', 'W1 9SD'),
  ('Jessica', 'Romaguera', '(150) 964-5686 x2614', 'jessica@yahoo.com', 'US', 'SE8 5PA'),
  #+end_example

  Create workers
  #+begin_src sqlite
  DROP TABLE IF EXISTS workers;

  CREATE TABLE workers(
  first_name VARCHAR(32),
  last_name VARCHAR(32),
  telephone VARCHAR(16),
  email VARCHAR,
  country VARCHAR(6),
  postcode VARCHAR(12),
  verified BOOLEAN,
  shifts_worked INTEGER
  );

  INSERT INTO workers VALUES
  ('Charlotte', 'Crona', '(358) 543-3871 x11661', 'charlotte@gmail.com', 'US', 'LS25 3AX', 1, 7),
  ('Oliver', 'Frami', '123-049-9312 x75410', 'oliver@hotmail.com', 'US', 'LS25 3AX', 1, 87),
  ('George', 'Miller', '1-829-690-4711 x64244', 'george@outlook.com', 'US', 'LS25 3AX', 1, 5),
  ('Emily', 'Nolan', '112-723-3906 x35944', 'emily@yahoo.com', 'GB', 'LS25 3AX', 1, 1),
  ('Oliver', 'Huel', '231-680-6707 x3907', 'oliver@yahoo.com', 'NZ', 'SE8 5PA', 1, 11),
  ('Olivia', 'Bayer', '539.597.3784 x971', 'olivia.bayer@yahoo.com', 'GB', 'LS25 3AX', 1, 1),
  ('Amelia', 'Ziemann', '439.776.0760 x16370', 'amelia@live.com', 'GB', 'TF1 1JA', 1, 42),
  ('Harry', 'Weissnat', '287.861.7897 x723', 'harry@gmail.com', 'GB', 'SE18 6EY', 0, 20),
  ('Emily', 'Stamm', '1-442-456-4126 x6543', 'emily@gmail.com', 'AU', 'LS25 3AX', 1, 17),
  ('Lucy', 'Lueilwitz', '(972) 434-9145', 'lucy@yahoo.com', 'GB', 'SE18 6EY', 1, 18),
  ('Amelia', 'Mertz', '(949) 299-5810 x72377', 'amelia@gmail.com', 'GB', 'SE8 5PA', 1, 10),
  ('Lucy', 'Hintz', '728.939.5077', 'lucy.hintz@yahoo.com', 'NZ', 'LS25 3AX', 1, 2),
  ('Oliver', 'Kuhic', '798-471-9536 x56285', 'oliver.kuhic@gmail.com', 'US', 'TF1 1JA', 0, 8),
  ('Jessica', 'Berge', '(923) 444-5956 x64054', 'jessica@gmail.com', 'US', 'TF1 1JA', 1, 4),
  ('George', 'Pouros', '1-546-234-2587 x3500', 'george@gmail.com', 'AU', 'W1 9SD', 1, 12),
  ('Olivia', 'Kling', '592-680-6368 x47550', 'olivia@gmail.com', 'GB', 'TF1 1JA', 0, 3),
  ('Charlotte', 'Roob', '651-713-8277 x371', 'charlotte@hotmail.com', 'AU', 'SE8 5PA', 1, 3),
  ('Oliver', 'Cronin', '1-450-883-3600 x67866', 'oliver@gmail.com', 'GB', 'SE5 9JW', 1, 23),
  ('Olivia', 'Morissette', '818-814-6348 x669', 'olivia@yahoo.com', 'GB', 'W1 9SD', 1, 1),
  ('Jessica', 'Romaguera', '(150) 964-5686 x2614', 'jessica@yahoo.com', 'FR', 'SE8 5PA', 0, 0)
  ;
  #+end_src

  #+RESULTS:

  #+begin_src sqlite :results output
  .schema workers
  #+end_src

  #+RESULTS:
  #+begin_example
  CREATE TABLE workers(
  first_name VARCHAR(32),
  last_name VARCHAR(32),
  telephone VARCHAR(16),
  email VARCHAR,
  country VARCHAR(6),
  postcode VARCHAR(12),
  verified BOOLEAN,
  shifts_worked INTEGER
  );
  #+end_example

  #+begin_src sqlite
  select * from workers;
  #+end_src

  #+RESULTS:
  | Charlotte | Crona      | (358) 543-3871 x11661 | charlotte@gmail.com    | US | LS25 3AX | 1 |  7 |
  | Oliver    | Frami      | 123-049-9312 x75410   | oliver@hotmail.com     | US | LS25 3AX | 1 | 87 |
  | George    | Miller     | 1-829-690-4711 x64244 | george@outlook.com     | US | LS25 3AX | 1 |  5 |
  | Emily     | Nolan      | 112-723-3906 x35944   | emily@yahoo.com        | GB | LS25 3AX | 1 |  1 |
  | Oliver    | Huel       | 231-680-6707 x3907    | oliver@yahoo.com       | NZ | SE8 5PA  | 1 | 11 |
  | Olivia    | Bayer      | 539.597.3784 x971     | olivia.bayer@yahoo.com | GB | LS25 3AX | 1 | 17 |
  | Amelia    | Ziemann    | 439.776.0760 x16370   | amelia@live.com        | GB | TF1 1JA  | 1 | 42 |
  | Harry     | Weissnat   | 287.861.7897 x723     | harry@gmail.com        | GB | SE18 6EY | 0 | 20 |
  | Emily     | Stamm      | 1-442-456-4126 x6543  | emily@gmail.com        | AU | LS25 3AX | 1 | 17 |
  | Lucy      | Lueilwitz  | (972) 434-9145        | lucy@yahoo.com         | GB | SE18 6EY | 1 | 18 |
  | Amelia    | Mertz      | (949) 299-5810 x72377 | amelia@gmail.com       | GB | SE8 5PA  | 1 | 10 |
  | Lucy      | Hintz      | 728.939.5077          | lucy.hintz@yahoo.com   | NZ | LS25 3AX | 1 |  2 |
  | Oliver    | Kuhic      | 798-471-9536 x56285   | oliver.kuhic@gmail.com | US | TF1 1JA  | 0 |  8 |
  | Jessica   | Berge      | (923) 444-5956 x64054 | jessica@gmail.com      | US | TF1 1JA  | 1 |  4 |
  | George    | Pouros     | 1-546-234-2587 x3500  | george@gmail.com       | AU | W1 9SD   | 1 | 12 |
  | Olivia    | Kling      | 592-680-6368 x47550   | olivia@gmail.com       | GB | TF1 1JA  | 0 | 15 |
  | Charlotte | Roob       | 651-713-8277 x371     | charlotte@hotmail.com  | AU | SE8 5PA  | 1 |  3 |
  | Oliver    | Cronin     | 1-450-883-3600 x67866 | oliver@gmail.com       | GB | SE5 9JW  | 1 | 23 |
  | Olivia    | Morissette | 818-814-6348 x669     | olivia@yahoo.com       | GB | W1 9SD   | 1 |  1 |
  | Jessica   | Romaguera  | (150) 964-5686 x2614  | jessica@yahoo.com      | FR | SE8 5PA  | 0 |  0 |

  #+begin_src sqlite
  select email, count(*) from workers group by email;
  #+end_src

  #+RESULTS:
  | amelia@gmail.com       | 1 |
  | amelia@live.com        | 1 |
  | charlotte@gmail.com    | 1 |
  | charlotte@hotmail.com  | 1 |
  | emily@gmail.com        | 1 |
  | emily@yahoo.com        | 1 |
  | george@gmail.com       | 1 |
  | george@outlook.com     | 1 |
  | harry@gmail.com        | 1 |
  | jessica@gmail.com      | 1 |
  | jessica@yahoo.com      | 1 |
  | lucy.hintz@yahoo.com   | 1 |
  | lucy@yahoo.com         | 1 |
  | oliver.kuhic@gmail.com | 1 |
  | oliver@gmail.com       | 1 |
  | oliver@hotmail.com     | 1 |
  | oliver@yahoo.com       | 1 |
  | olivia.bayer@yahoo.com | 1 |
  | olivia@gmail.com       | 1 |
  | olivia@yahoo.com       | 1 |
